app/Controllers/Admin/Users.php

    public function index()
    {

        $data = [

            'title' => 'Listando os usuários',
            'users' => $this->userModel->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    private function searchUserOr404(int $id = null)
    {

        if (!$id || !$user = $this->userModel->where('id', $id)->first()) {
---
SELECT *
FROM `users`
WHERE `id` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1