app/Models/UserModel.php

SELECT `id`, `name`
FROM `users`
WHERE `name` LIKE '%yhtyu%' ESCAPE '!'
---
    public function search($term)
    {

        if ($term === null) {

            return [];

        }

        return $this->select('id, name')
                    ->like('name', $term)
                    ->get()
                    ->getResult();